letssteam/codal-stm32l475/source/PeripheralPins.cpp
//*** PWM ***

#ifdef HAL_TIM_MODULE_ENABLED
extern "C" const PinMap PinMap_PWM[] = {
    {codal::PinNumber::PA_0,   PWM_2,   STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF1_TIM2, 1, 0)},    // TIM_2_CH1 - D1/UART4_TX
//  {codal::PinNumber::PA_0,   PWM_5,   STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF2_TIM5, 1, 0)},    // TIM_5_CH1 - D1/UART4_TX
    {codal::PinNumber::PA_1,   PWM_15,  STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF14_TIM15, 1, 1)},  // TIM_15_CH1N - D0/UART4_RX
//  {codal::PinNumber::PA_1,   PWM_2,   STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF1_TIM2, 2, 0)},    // TIM_2_CH2 - D0/UART4_RX
//  {codal::PinNumber::PA_1,   PWM_5,   STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF2_TIM5, 2, 0)},    // TIM_5_CH2 - D0/UART4_RX
//  {codal::PinNumber::PA_2,   PWM_15,  STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF14_TIM15, 1, 0)},  // TIM_15_CH1 - D10/PWM
    {codal::PinNumber::PA_2,   PWM_2,   STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF1_TIM2, 3, 0)},    // TIM_2_CH3 - D10 - D10/PWM
//  {codal::PinNumber::PA_2,   PWM_5,   STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF2_TIM5, 3, 0)},    // TIM_5_CH3 - D10/PWM
    {codal::PinNumber::PA_3,   PWM_15,  STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF14_TIM15, 2, 0)},  // TIM_15_CH2 - D4
//  {codal::PinNumber::PA_3,   PWM_2,   STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF1_TIM2, 4, 0)},    // TIM_2_CH4 - D4
//  {codal::PinNumber::PA_3,   PWM_5,   STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF2_TIM5, 4, 0)},    // TIM_5_CH4 - D4
//  {codal::PinNumber::PA_5,   PWM_2,   STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF1_TIM2, 1, 0)},    // TIM_2_CH1 - D13/SPI1_SCK/LED1
    {codal::PinNumber::PA_5,   PWM_8,   STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF3_TIM8, 1, 1)},    // TIM_8_CH1N - D13/SPI1_SCK/LED1
    {codal::PinNumber::PA_6,   PWM_16,  STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF14_TIM16, 1, 0)},  // TIM_16_CH1 - D12/SPI_MISO
//  {codal::PinNumber::PA_6,   PWM_3,   STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF2_TIM3, 1, 0)},    // TIM_3_CH1 - D12/SPI_MISO
    {codal::PinNumber::PA_7,   PWM_17,  STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF14_TIM17, 1, 0)},  // TIM_17_CH1 - D11/SPI1_MOSI/PWM
//  {codal::PinNumber::PA_7,   PWM_1,   STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF1_TIM1, 1, 1)},    // TIM_1_CH1N - D11/SPI1_MOSI/PWM
//  {codal::PinNumber::PA_7,   PWM_3,   STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF2_TIM3, 2, 0)},    // TIM_3_CH2 - D11/SPI1_MOSI/PWM
//  {codal::PinNumber::PA_7,   PWM_8,   STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF3_TIM8, 1, 1)},    // TIM_8_CH1N - D11/SPI1_MOSI/PWM
//  {codal::PinNumber::PA_8,   PWM_1,   STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF1_TIM1, 1, 0)},    // TIM_1_CH1 - SPBTLE-RF-RST
//  {codal::PinNumber::PA_9,   PWM_1,   STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF1_TIM1, 2, 0)},    // TIM_1_CH2 - USB_OTG_FS_VBUS
//  {codal::PinNumber::PA_10,  PWM_1,   STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF1_TIM1, 3, 0)},    // TIM_1_CH3 - USB_OTG_FS_ID
//  {codal::PinNumber::PA_11,  PWM_1,   STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF1_TIM1, 4, 0)},    // TIM_1_CH4 - USB_OTG_FS_DM
    {codal::PinNumber::PA_15,  PWM_2,   STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF1_TIM2, 1, 0)},    // TIM_2_CH1 - D9/PWM
//  {codal::PinNumber::PB_0,   PWM_1,   STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF1_TIM1, 2, 1)},    // TIM_1_CH2N - D3/PWM
    {codal::PinNumber::PB_0,   PWM_3,   STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF2_TIM3, 3, 0)},    // TIM_3_CH3 - D3/PWM
//  {codal::PinNumber::PB_0,   PWM_8,   STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF3_TIM8, 2, 1)},    // TIM_8_CH2N - D3/PWM
//  {codal::PinNumber::PB_1,   PWM_1,   STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF1_TIM1, 3, 1)},    // TIM_1_CH3N - D6/PWM
    {codal::PinNumber::PB_1,   PWM_3,   STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF2_TIM3, 4, 0)},    // TIM_3_CH4 - D6/PWM
//  {codal::PinNumber::PB_1,   PWM_8,   STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF3_TIM8, 3, 1)},    // TIM_8_CH3N - D6/PWM
//  {codal::PinNumber::PB_3,   PWM_2,   STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF1_TIM2, 2, 0)},    // TIM_2_CH2 - SYS_JTDO-SWO
    {codal::PinNumber::PB_4,   PWM_3,   STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF2_TIM3, 1, 0)},    // TIM_3_CH1 - D5/PWM
//  {codal::PinNumber::PB_5,   PWM_3,   STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF2_TIM3, 2, 0)},    // TIM_3_CH2 - SPSGRF-915-SPI3_CSN
//  {codal::PinNumber::PB_6,   PWM_16,  STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF14_TIM16, 1, 1)},  // TIM_16_CH1N - ST-LINK-UART1_TX
//  {codal::PinNumber::PB_6,   PWM_4,   STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF2_TIM4, 1, 0)},    // TIM_4_CH1  - ST-LINK-UART1_TX
//  {codal::PinNumber::PB_7,   PWM_17,  STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF14_TIM17, 1, 1)},  // TIM_17_CH1N - ST-LINK-UART1_RX
//  {codal::PinNumber::PB_7,   PWM_4,   STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF2_TIM4, 2, 0)},    // TIM_4_CH2 - ST-LINK-UART1_RX
    {codal::PinNumber::PB_8,   PWM_16,  STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF14_TIM16, 1, 0)},  // TIM_16_CH1 - D15/I2C1_SCL
//  {codal::PinNumber::PB_8,   PWM_4,   STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF2_TIM4, 3, 0)},    // TIM_4_CH3 - D15/I2C1_SCL
    {codal::PinNumber::PB_9,   PWM_17,  STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF14_TIM17, 1, 0)},  // TIM_17_CH1 - D14/I2C1_SDA
//  {codal::PinNumber::PB_9,   PWM_4,   STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF2_TIM4, 4, 0)},    // TIM_4_CH4 - D14/I2C1_SDA
//  {codal::PinNumber::PB_10,  PWM_2,   STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF1_TIM2, 3, 0)},    // TIM_2_CH3 - INTERNAL-I2C2_SCL
//  {codal::PinNumber::PB_11,  PWM_2,   STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF1_TIM2, 4, 0)},    // TIM_2_CH4 - INTERNAL-I2C2_SDA
//  {codal::PinNumber::PB_13,  PWM_15,  STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF14_TIM15, 1, 1)},  // TIM_15_CH1N - ISM43362-WAKEUP
//  {codal::PinNumber::PB_13,  PWM_1,   STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF1_TIM1, 1, 1)},    // TIM_1_CH1N - ISM43362-WAKEUP
    {codal::PinNumber::PB_14,  PWM_15,  STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF14_TIM15, 1, 0)},  // TIM_15_CH1 - LED2
//  {codal::PinNumber::PB_14,  PWM_1,   STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF1_TIM1, 2, 1)},    // TIM_1_CH2N - LED2
//  {codal::PinNumber::PB_14,  PWM_8,   STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF3_TIM8, 2, 1)},    // TIM_8_CH2N - LED2
//  {codal::PinNumber::PB_15,  PWM_15,  STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF14_TIM15, 2, 0)},  // TIM_15_CH2 - SPSGRF-915-SDN
//  {codal::PinNumber::PB_15,  PWM_1,   STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF1_TIM1, 3, 1)},    // TIM_1_CH3N - SPSGRF-915-SDN
//  {codal::PinNumber::PB_15,  PWM_8,   STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF3_TIM8, 3, 1)},  // TIM_8_CH3N - SPSGRF-915-SDN
//  {codal::PinNumber::PC_6,   PWM_3,   STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF2_TIM3, 1, 0)},  // TIM_3_CH1 - VL53L0X_XSHUT
//  {codal::PinNumber::PC_6,   PWM_8,   STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF3_TIM8, 1, 0)},  // TIM_8_CH1 - VL53L0X_XSHUT
//  {codal::PinNumber::PC_7,   PWM_3,   STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF2_TIM3, 2, 0)},  // TIM_3_CH2 - VL53L0X_GPIO1_EXTI7
//  {codal::PinNumber::PC_7,   PWM_8,   STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF3_TIM8, 2, 0)},  // TIM_8_CH2 - VL53L0X_GPIO1_EXTI7
//  {codal::PinNumber::PC_8,   PWM_3,   STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF2_TIM3, 3, 0)},  // TIM_3_CH3 - VL53L0X_GPIO1_EXTI7
//  {codal::PinNumber::PC_8,   PWM_8,   STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF3_TIM8, 3, 0)},  // TIM_8_CH3 - VL53L0X_GPIO1_EXTI7
//  {codal::PinNumber::PC_9,   PWM_3,   STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF2_TIM3, 4, 0)},  // TIM_3_CH4 - LED3 (WIFI) & LED4 (BLE)
//  {codal::PinNumber::PC_9,   PWM_8,   STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF3_TIM8, 4, 0)},  // TIM_8_CH4 - LED3 (WIFI) & LED4 (BLE)
//  {codal::PinNumber::PD_12,  PWM_4,   STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF2_TIM4, 1, 0)},  // TIM_4_CH1 - USB_OTG_FS_PWR_EN
//  {codal::PinNumber::PD_13,  PWM_4,   STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF2_TIM4, 2, 0)},  // TIM_4_CH2 - SPBTLE-RF-SPI3_CSN
    {codal::PinNumber::PD_14,  PWM_4,   STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF2_TIM4, 3, 0)},  // TIM_4_CH3 - D2
//  {codal::PinNumber::PD_15,  PWM_4,   STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF2_TIM4, 4, 0)},  // TIM_4_CH4 - HTS221_DRDY_EXTI15
//  {codal::PinNumber::PE_0,   PWM_16,  STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF14_TIM16, 1, 0)},  // TIM_16_CH1 - ISM43362-SPI3_CSN
//  {codal::PinNumber::PE_1,   PWM_17,  STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF14_TIM17, 1, 0)},  // TIM_17_CH1 - ISM43362-DRDY_EXTI1
//  {codal::PinNumber::PE_3,   PWM_3,   STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF2_TIM3, 1, 0)},  // TIM_3_CH1 - USB_OTG_OVRCR_EXTI3
//  {codal::PinNumber::PE_4,   PWM_3,   STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF2_TIM3, 2, 0)},  // TIM_3_CH2 - M24SR64-Y-GPO
//  {codal::PinNumber::PE_5,   PWM_3,   STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF2_TIM3, 3, 0)},  // TIM_3_CH3 - SPSGRF-915-GPIO3_EXTI5
//  {codal::PinNumber::PE_6,   PWM_3,   STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF2_TIM3, 4, 0)},  // TIM_3_CH4 - SPBTLE-RF-IRQ_EXTI6
//  {codal::PinNumber::PE_8,   PWM_1,   STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF1_TIM1, 1, 1)},  // TIM_1_CH1N - ISM43362-RST
//  {codal::PinNumber::PE_9,   PWM_1,   STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF1_TIM1, 1, 0)},  // TIM_1_CH1 - DFSDM1_CKOUT
//  {codal::PinNumber::PE_10,  PWM_1,   STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF1_TIM1, 2, 1)},  // TIM_1_CH2N - QUADSPI_CLK
//  {codal::PinNumber::PE_11,  PWM_1,   STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF1_TIM1, 2, 0)},  // TIM_1_CH2 - QUADSPI_NCS
//  {codal::PinNumber::PE_12,  PWM_1,   STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF1_TIM1, 3, 1)},  // TIM_1_CH3N - QUADSPI_BK1_IO0
//  {codal::PinNumber::PE_13,  PWM_1,   STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF1_TIM1, 3, 0)},  // TIM_1_CH3 - QUADSPI_BK1_IO1
//  {codal::PinNumber::PE_14,  PWM_1,   STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF1_TIM1, 4, 0)},  // TIM_1_CH4 - QUADSPI_BK1_IO2
    {codal::PinNumber::NC,    NP,    0}
};
#endif

//*** SERIAL ***

